import efaqa_corpus_zh
#import sys
#import io
#sys.stdout = io.TextIOWrapper(buffer=sys.stdout.buffer,encoding='utf-8')

# data is a dictionary
# Keys: owner, title, label, chats
# owner is a string who is 咨询者
# title is a string
# label is a dictionary, use .get('s1') .get('s2') or .get(s3) to access corresponding information
# s1：烦恼类型
# s2：心理疾病
# s3：SOS

#chat is an array, containing multiple records of the chat
#each record if a dictionary containing:
#label
#	each label is a dictionary containing 'knowledge', 'negative' and 'question'
#		knowledge：是否带有知识，含知识内容有助于开导咨询者
#		question：是否是追问，追问可以让咨询者更多倾诉
#		negative：负面回复，对咨询者起负面作用
#sender
#	owner 代表消息是咨询者发出的，audience代表是网友发出的
#time
#type
#value
#	chat的具体内容

s1_1 = {
	'id':'1.1',
	'中文':'学业烦恼、对未来规划的迷茫',
	'英文':'Academic Concerns',
	'备注':'学业烦恼包括学习障碍、学习吃力、学习成绩差、注意力不集中和对学习科目无兴趣等。'
}

s1_2 = {
	'id':'1.2',
	'中文':'事业和工作烦恼',
	'英文':'Career and Workplace Issues',
	'备注':'在工作中的，人际冲突问题、沟通问题、谣言、职场骚扰、歧视、动力不足和工作满意度低和职场表现差等问题。'
}

s1_3 = {
	'id':'1.3',
	'中文':'家庭问题和矛盾',
	'英文':'Family Issues and Conflict',
	'备注':'家庭问题和矛盾包括家庭暴力、金钱遗产争执、家庭不和睦、婆媳问题、子女们对年长父母看护问题、继父母继子女冲突问题和离异父母对于儿女的养护问题。'
}

s1_4 = {
	'id':'1.4',
	'中文':'物质滥用',
	'英文':'Substance Abuse and Addiction',
	'备注':'成人如酗酒、吸烟、药物滥用、吸毒、赌博和任何影响生活品质的上瘾行为。'
}

s1_5 = {
	'id':'1.5',
	'中文':'悲恸',
	'英文':'Grief',
	'备注':'由于痛失亲人或朋友而引起的极大悲伤。'
}

s1_6 = {
	'id':'1.6',
	'中文':'失眠',
	'英文':'Insomnia',
	'备注':'无法入睡或难以保持入睡状态而影响第二天表现的睡眠障碍。'
}

s1_7 = {
	'id':'1.7',
	'中文':'压力',
	'英文':'Stress',
	'备注':'压力是一种情绪上或身体上的紧张感。它可能来自任何使您感到沮丧，愤怒或紧张的事件或想法。'
}

s1_8 = {
	'id':'1.8',
	'中文':'	人际关系',
	'英文':'Interpersonal Relationship',
	'备注':'不属于职场、学校以及家庭的人际关系紧张与矛盾。'
}

s1_9 = {
	'id':'1.9',
	'中文':'情感关系问题',
	'英文':'Relationship Issues',
	'备注':'早恋、暗恋、异地恋、出轨、吵架、复合、LGBT 群体'
}

s1_10 = {
	'id':'1.10',
	'中文':'离婚',
	'英文':'Divorce',
	'备注':'离婚后情感以及孩子的问题'
}

s1_11 = {
	'id':'1.11',
	'中文':'分手',
	'英文':'Break Up	',
	'备注':'分手后的痛苦'
}

s1_12 = {
	'id':'1.12',
	'中文':'自我探索',
	'英文':'Self-Awareness',
	'备注':'如星座、性格、兴趣等'
}

s1_13 = {
	'id':'1.13',
	'中文':'低自尊',
	'英文':'Low self-esteem',
	'备注':'低自尊心的表现 自尊是一个人对自己的价值的主观评价。自尊包括对自己以及情绪状态的信念，例如胜利，绝望，骄傲和羞耻。'
}

s1_14 = {
	'id':'1.14',
	'中文':'青春期问题',
	'英文':'Adolescent Problem',
	'备注':'青春期少年在身心成长上所面临的问题，如叛逆、伤害他人、怀孕、药物滥用和青少年犯罪。'
}

s1_15 = {
	'id':'1.15',
	'中文':'强迫症',
	'英文':'OCD',
	'备注':'强迫症的人会陷入一种无意义、且令人沮丧的重复的想法与行为当中，但是一直想却无法摆脱它。'
}

s1_16 = {
	'id':'1.16',
	'中文':'其它',
	'英文':'Others',
	'备注':'其他烦恼，虽然对生活学习没有造成毁灭性的阻碍，但是却依然会引起心里不适。'
}

s1_17 = {
	'id':'1.17',
	'中文':'男同性恋、女同性恋、双性恋与跨性别',
	'英文':'LGBT',
	'备注':'男同性恋、女同性恋、双性恋与跨性别'
}

s1_18 = {
	'id':'1.18',
	'中文':'性问题',
	'英文':'Sex',
	'备注':'对于青少年，是性教育不足引起各种社会问题；对于成年人，性焦虑与性上瘾可以演变成生理疾病。'
}

s1_19 = {
	'id':'1.19',
	'中文':'亲子关系',
	'英文':'Parent-child relationship',
	'备注':'亲子关系，从婴幼儿时期就开始影响着孩子各方面的发展，比如性格、毅力、人际交往等等。'
}

s2_1 = {
	'id':'2.1',
	'中文':'忧郁症',
	'英文':'Depression',
	'备注':'长时间持续的抑郁情绪，并且这种情绪明显超过必要的限度，缺乏自信，避开人群，甚至有罪恶感，感到身体能量的明显降低，时间的感受力减慢，无法在任何有趣的活动中体会到快乐。'
}

s2_2 = {
	'id':'2.2',
	'中文':'焦虑症',
	'英文':'Anxiety',
	'备注':'长时间持续性的焦虑情绪，无明确客观对象却依然紧张担心，坐立不安，如心悸、手抖、出汗、尿频、注意力难以集中。'
}

s2_3 = {
	'id':'2.3',
	'中文':'躁郁症',
	'英文':'Bipolar Disorder',
	'备注':'又称为"双向情感障碍" 。狂躁期：感到生机勃勃、精力充沛以及情感高涨或易被激惹。也可感到过度自信，行为或穿着铺张浪费，睡眠极少且语量增多。'
}

s2_4 = {
	'id':'2.4',
	'中文':'创伤后应激反应',
	'英文':'PTSD',
	'备注':'首先要经历创伤：如孩童时期遭受身体或心理上的虐待；接触相关事物时会有精神或身体上的不适和紧张，创伤的情景会一遍一遍在脑海中重演。'
}

s2_5 = {
	'id':'2.5',
	'中文':'恐慌症',
	'英文':'Panic Disorder',
	'备注':'又称急性焦虑症，是反复发生的惊恐发作。惊恐发作是突然的短期强烈的恐惧（濒死感），包含心悸、流汗、手颤抖、呼吸困难、麻痹感。'
}

s2_6 = {
	'id':'2.6',
	'中文':'厌食症和暴食症',
	'英文':'Eating Disorder',
	'备注':'厌食症：吃太少导致体重偏轻；暴食症：大量进食后再想办法吐出来。两种疾病都对"瘦"有着极端的追求，对自己身体不满意，在生活学习上有极端完美主义心态。'
}

s2_7 = {
	'id':'2.7',
	'中文':'尚未达到S2',
	'英文':'Unrelated',
	'备注':'还没有严重到心理疾病'
}

s2_8 = {
	'id':'2.8',
	'中文':'其它疾病',
	'英文':'Others',
	'备注':'已经严重影响生活和工作，甚至生活工作不能进行，但并不能确认是哪一类疾病的情况。'
}


s3_1 = {
	'id':'3.1',
	'中文':'正在进行的自杀行为',
	'英文':'Suicide Action',
	'备注':'N/A'
}

s3_2 = {
	'id':'3.2',
	'中文':'策划进行的自杀行为',
	'英文':'Suicide Ideation',
	'备注':'N/A'
}

s3_3 = {
	'id':'3.3',
	'中文':'自残',
	'英文':'Self-harm',
	'备注':'N/A'
}

s3_4 = {
	'id':'3.4',
	'中文':'进行的人身伤害',
	'英文':'N/A',
	'备注':'正在对他人进行伤害'
}

s3_5 = {
	'id':'3.5',
	'中文':'计划的人身伤害',
	'英文':'N/A',
	'备注':'计划对他人进行伤害'
}

s3_6 = {
	'id':'3.6',
	'中文':'无伤害身体倾向',
	'英文':'N/A',
	'备注':'N/A'
}

severity = {
	'1.1' : s1_1,
	'1.2' : s1_2,
	'1.3' : s1_3,
	'1.4' : s1_4,
	'1.5' : s1_5,
	'1.6' : s1_6,
	'1.7' : s1_7,
	'1.8' : s1_8,
	'1.9' : s1_9,
	'1.10' : s1_10,
	'1.11' : s1_11,
	'1.12' : s1_12,
	'1.13' : s1_13,
	'1.14' : s1_14,
	'1.15' : s1_15,
	'1.16' : s1_16,
	'1.17' : s1_17,
	'1.18' : s1_18,
	'1.19' : s1_19,
	'2.1' : s2_1,
	'2.2' : s2_2,
	'2.3' : s2_3,
	'2.4' : s2_4,
	'2.5' : s2_5,
	'2.6' : s2_6,
	'2.7' : s2_7,
	'2.8' : s2_8,
	'3.1' : s3_1,
	'3.2' : s3_2,
	'3.3' : s3_3,
	'3.4' : s3_4,
	'3.5' : s3_5,
	'3.6' : s3_6,

}


data = list(efaqa_corpus_zh.load())
#print('size: %s' % len(l))

for i in range(10):
	#print(data[i]['owner'])
	print(data[i]['title'])
	print()
	#print(data[i]['label'].get('s1'))
	chat = data[i]['chats']
	#print(data[i]['chats'])
	#print(chat[0].get('label').get('knowledge'))
	labels = data[1]['label']
	print('初步诊断：')
	for s in labels.values():
		print(s + ": " + severity.get(s).get('中文') + "   note: " + severity.get(s).get('备注'))

	print()
	print("留言：")
	

	for rec in chat:
		print(rec.get('sender') + '：' + rec.get('value'))
		print()

	print("------------------------------")




#print(s1_1.get('备注'))